<template>
    <v-container>
        <div>
            <span class="text-h5">Сторінка конфігурації сервера OpenStack</span>
            <div>На цій сторінці можна побачити загальну інформацію щодо конфігурацій серверів та створених серверів.
                Якщо користувач є адміністратором, то йому будуть відображатися усі наявні сервери у системі. Інакше -
                то
                тільки ті, які створені даним користувачем.
            </div>
            <ol>
                <li>
                    <span class="text-h6">Вибір типів серверів:</span>
                    <div>Вам пропонується чотири типи серверів на основі конфігурації OpenStack та дистрибутиву з Cirros
                        0.6.2x86_64.
                    </div>
                    <ul>
                        <li><span class="font-weight-bold">Базовий</span>: Ідеально підходить для початківців, пропонує базове налаштування, яке
                            підходить
                            для тих,
                            хто тільки починає вивчати аналіз даних на OpenStack.
                        </li>
                        <li><span class="font-weight-bold">Легка</span>: Налаштована на середній рівень і призначена для завдань з невеликими
                            наборами
                            даних. Вона
                            забезпечує баланс між обчислювальною потужністю та оптимізацією ресурсів, підходить для
                            задач з
                            великими
                            даними.
                        </li>
                        <li><span class="font-weight-bold">Покращена</span>: Сервер вищого рівня, оптимізований для обробки великих обсягів
                            даних. Ця
                            конфігурація
                            обіцяє більше ресурсів для оптимізованої обробки даних.
                        </li>
                        <li><span class="font-weight-bold">Професійна</span>: Сервер найвищого рівня, призначений для обробки великих
                            обсягів
                            даних. Забезпечує
                            ефективне використання значних ресурсів процесора.
                        </li>
                    </ul>
                    Для кожного типу ви можете натиснути "СТВОРИТИ СЕРВЕР", щоб ініціювати налаштування сервера
                    відповідного
                    типу.
                </li>
                <li>
                    <span class="text-h6">Поточні сервери</span>
                    <div>
                        У розділі "Сервери" ви можете побачити список серверів, які налаштовані на даний момент.
                        <ul>
                            <li><span class="font-weight-bold">Назва</span>: Назва сервера.</li>
                            <li><span class="font-weight-bold">Статус</span>: Показує поточний статус сервера.</li>
                            <li><span class="font-weight-bold">Публічна IP-адреса</span>: Показує публічну IP-адресу сервера.</li>
                            <li><span class="font-weight-bold">Приватна IP-адреса</span>: Показує приватну IP-адресу сервера.</li>
                            <li><span class="font-weight-bold">Дата створення</span>: Дата і час створення сервера.</li>
                            <li><span class="font-weight-bold">Дії</span>:
                                <ul>
                                    <li><span class="font-weight-bold">"ЗМІНИТИ"</span>: Натисніть, щоб змінити налаштування сервера.</li>
                                    <li><span class="font-weight-bold">"ВИДАЛИТИ"</span>: Натисніть, щоб видалити сервер.</li>
                                </ul>
                            </li>
                        </ul>
                    </div>

                </li>
            </ol>
        </div>
        <v-divider class="ma-4" :thickness="4"></v-divider>
        <div>
            <span class="text-h5">Сторінка з деталями серверу</span>
            <div>Ця сторінка представляє собою інтерфейс управління сервером. Вона дозволяє користувачам переглядати
                різноманітні деталі сервера, а також виконувати ряд дій для управління сервером.
            </div>
            <ol>
                <li>
                    <span class="text-h6">Основні розділи сторінки:</span>
                    <ul>
                        <li><span class="font-weight-bold">Базова Інформація</span>: Надає ключову інформацію про сервер,
                            включаючи його ІД, ім'я, статус, IP-адреси та час створення/оновлення.
                        </li>
                        <li><span class="font-weight-bold">Конфігурація Обладнання</span>: Показує характеристики фізичного
                            обладнання сервера.
                        </li>
                        <li><span class="font-weight-bold">Образ</span>: Представляє собою деталі образу операційної системи,
                            встановленої на сервері.
                        </li>
                        <li><span class="font-weight-bold">Метадані</span>: Додаткова інформація або розширені дані, які
                            можуть бути пов'язані з сервером.
                        </li>
                        <li><span class="font-weight-bold">Уся Інформація</span>: Розділ для технічно-орієнтованих
                            користувачів, який надає детальну інформацію про сервер в форматі JSON.
                        </li>
                    </ul>
                </li>
                <li>
                    <span class="text-h6">Функціональність</span>
                    <div>
                        У розділі "Сервери" ви можете побачити список серверів, які налаштовані на даний момент.
                        <ul>
                            <li><span class="font-weight-bold">Кнопки Дії</span>: "Консоль", "Змінити" та "Видалити" надають
                                можливість взаємодії з сервером, включаючи доступ до консолі, зміну налаштувань та
                                видалення сервера відповідно.
                            </li>
                            <li><span class="font-weight-bold">Графічний Інтерфейс</span>: Інтерфейс є інтуїтивно зрозумілим і
                                розбитим на розділи для зручності користувачів.
                            </li>
                        </ul>
                    </div>

                </li>
            </ol>
        </div>
    </v-container>
</template>

<style>
ul li, ol li {
    line-height: 160%; /*or whatever height you like*/
}

ul, ol {
    margin: 0;
    padding: 0 0 0 2em;
}
</style>